package day21_0804;

public class Exam1_d21 {
    public static void main(String[] args) {
        /*
            1. [객체]란? 상태 또는 행위를 정의하는 것
                -> 주체(행위 대상, 개발자) vs 객체(행위가 미치는 대상, 프로그램 내 모든 대상) 
                -> 상태(값/자료), 행위(함수/메서드)
            2. 객체지향 프로그래밍 : 개발자(주체)가 컴퓨터내 객체(대상) 만들기
            3. 객체 정의: 클래스(설계도) 기반으로 객체 정의.
            4. [클래스]란? 객체(추상)의 상태와 행위 코드로 정의한 곳
                1) 설계(정의)클래스(객체정의용)   2) main클래스(실행목적용)
            5 [인스턴스]란?  클래스로 (객체가) 정의된 기반으로 메모리 할당( 물리개념 )
                new 연산자 이용
            *** 8가지( boolean, char, byte, short, int, long, float, double) 기본타입
            8가지 커스텀 타입 -> 클래스 타입/ 참조 타입*****
            즉] 클래스란? 존재하지 않는 타입 만드는 것과 동일 
        */
    
    }
}
